In [10]:
import db

In [11]:
table = db.conn(
    '''
    select b.borough, t.fare_amount
    from taxi_trips as t
    inner join borough as b
    on t.idborough = b.idborough;
    '''
)

[2022-07-25 17:04:26] - Iniciando conexion a base de datos...
[2022-07-25 17:04:26] - Conexion Exitosa.
[2022-07-25 17:04:30] - Tabla cargada exitosamente.

In [12]:
table

          borough  fare_amount
0       Manhattan          9.0
1       Manhattan          5.5
2          Queens          2.5
3       Manhattan         20.0
4       Manhattan          8.0
...           ...          ...
994917  Manhattan          7.0
994918  Manhattan         12.0
994919  Manhattan         14.5
994920  Manhattan         14.5
994921  Manhattan         16.0

[994922 rows x 2 columns]

In [ ]:
# TODO: Mapa sencillo
fig = px.choropleth(df, 
                    locations='id_borough', 
                    geojson=nyc_boroughs, 
                    color='Borough',
                    scope='usa'
                    )
fig.update_geos(fitbounds="locations", visible=False)

In [ ]:
#df = df
#geojson = nyc_boroughs
#40.730610, and the longitude is -73.935242
#fig = px.choropleth_mapbox(df, geojson=nyc_boroughs, color="Borough",
#                           locations="id_borough", featureidkey="id",
#                           center={"lat": 40.730610, "lon": -73.935242},
#                           mapbox_style="carto-positron", zoom=9, opacity=0.3)
#fig.update_layout(margin={"r":0,"t":0,"l":0,"b":0})
#fig.show()

In [ ]:
import plotly.express as px

def medals_fig():
    df = px.data.medals_long()
    fig = px.bar(df, x="medal", y="count", color="nation", text="nation")

    return fig